app/views/manufacturers/show.html.erb

</p>
<% @manufacturer.products.each do |product| %>
---
SELECT "products".* FROM "products" WHERE "products"."manufacturer_id" = ?  [["manufacturer_id", 1]]